import React, { useState } from "react";
import styles from "./Axes.module.css";
import AccordionItem from "./AccordionItem";

const data = [
  {
    title: "المحور الأول: مقدمة حول أنظمة الري",
    content: [
      {
        "الدرس الأول": "تعريف بأنظمة الري وأهميتها في الزراعة",
        "الدرس الثاني": "أنواع أنظمة الري المستخدمة في الفلاحة",
        "الدرس الثالث": "العوامل المؤثرة في اختيار نظام الري المناسب",
      },
    ],
  },
  {
    title: "المحور الثاني: تصميم أنظمة الري اليدوي والآلي",
    content: [
      {
        "الدرس الأول": "تعريف بأنظمة الري وأهميتها في الزراعة",
        "الدرس الثاني": "أنواع أنظمة الري المستخدمة في الفلاحة",
        "الدرس الثالث": "العوامل المؤثرة في اختيار نظام الري المناسب",
        "الدرس الرابع": "العوامل المؤثرة في اختيار نظام الري المناسب",
      },
    ],
  },
  {
    title: "المحور الثالث: إدارة وصيانة أنظمة الري",
    content: [
      {
        "الدرس الأول": "تعريف بأنظمة الري وأهميتها في الزراعة",
        "الدرس الثاني": "أنواع أنظمة الري المستخدمة في الفلاحة",
        "الدرس الثالث": "العوامل المؤثرة في اختيار نظام الري المناسب",
        "الدرس الرابع": "العوامل المؤثرة في اختيار نظام الري المناسب",
        "الدرس الخامس": "العوامل المؤثرة في اختيار نظام الري المناسب",
      },
    ],
  },
  {
    title : "المحور الرابع: الابتكار في أنظمة الري الذكية",
    content: [
      {
        "الدرس الأول": "تعريف بأنظمة الري وأهميتها في الزراعة",
        "الدرس الثاني": "أنواع أنظمة الري المستخدمة في الفلاحة",
        "الدرس الثالث": "العوامل المؤثرة في اختيار نظام الري المناسب",
      },
    ],
  },
];


export default function Accordion() {
  return (
    <div className={styles.accordion_container}>
      {data.map((item, index) => (
        <AccordionItem key={index} title={item.title} content={item.content} />
      ))}
    </div>
  );
}
